vertical-pod-autoscaler/experiments/sn-pbr-throughput/11plus/home.log
Running 15m test @ http://10.97.187.117:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.851ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.999ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.33m     3.08m   10.19m    54.32%
    Req/Sec    10.37     32.42   166.00     89.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.64m 
 75.000%    5.84m 
 90.000%    8.01m 
 99.000%   10.19m 
 99.900%   11.22m 
 99.990%   11.32m 
 99.999%   11.33m 
100.000%   11.33m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.046     0.000000            1         1.00
      32.415     0.100000         1809         1.11
     240.895     0.200000         3617         1.25
   38600.703     0.300000         5425         1.43
   93454.335     0.400000         7234         1.67
  158466.047     0.500000         9045         2.00
  195035.135     0.550000         9948         2.22
  232914.943     0.600000        10853         2.50
  271581.183     0.650000        11755         2.86
  310640.639     0.700000        12663         3.33
  350486.527     0.750000        13564         4.00
  373030.911     0.775000        14019         4.44
  395313.151     0.800000        14472         5.00
  416546.815     0.825000        14925         5.71
  438042.623     0.850000        15375         6.67
  459276.287     0.875000        15827         8.00
  470024.191     0.887500        16051         8.89
  480509.951     0.900000        16281        10.00
  491782.143     0.912500        16501        11.43
  504102.911     0.925000        16727        13.33
  514588.671     0.937500        16955        16.00
  520355.839     0.943750        17068        17.78
  526385.151     0.950000        17183        20.00
  531103.743     0.956250        17296        22.86
  536084.479     0.962500        17408        26.67
  544210.943     0.968750        17522        32.00
  548405.247     0.971875        17576        35.56
  555745.279     0.975000        17632        40.00
  562561.023     0.978125        17690        45.71
  569901.055     0.981250        17747        53.33
  576716.799     0.984375        17805        64.00
  583532.543     0.985938        17830        71.11
  594018.303     0.987500        17857        80.00
  605028.351     0.989062        17886        91.43
  616038.399     0.990625        17915       106.67
  627048.447     0.992188        17943       128.00
  631767.039     0.992969        17957       142.22
  637009.919     0.993750        17971       160.00
  642252.799     0.994531        17986       182.86
  648019.967     0.995313        17999       213.33
  653262.847     0.996094        18015       256.00
  655884.287     0.996484        18021       284.44
  657981.439     0.996875        18027       320.00
  660602.879     0.997266        18034       365.71
  664272.895     0.997656        18041       426.67
  666370.047     0.998047        18049       512.00
  667942.911     0.998242        18053       568.89
  668991.487     0.998437        18055       640.00
  670564.351     0.998633        18059       731.43
  672137.215     0.998828        18062       853.33
  673710.079     0.999023        18067      1024.00
  674234.367     0.999121        18069      1137.78
  674234.367     0.999219        18069      1280.00
  675282.943     0.999316        18071      1462.86
  676331.519     0.999414        18073      1706.67
  677380.095     0.999512        18075      2048.00
  677904.383     0.999561        18076      2275.56
  677904.383     0.999609        18076      2560.00
  678428.671     0.999658        18077      2925.71
  678952.959     0.999707        18079      3413.33
  678952.959     0.999756        18079      4096.00
  679477.247     0.999780        18082      4551.11
  679477.247     0.999805        18082      5120.00
  679477.247     0.999829        18082      5851.43
  679477.247     0.999854        18082      6826.67
  679477.247     0.999878        18082      8192.00
  679477.247     0.999890        18082      9102.22
  679477.247     0.999902        18082     10240.00
  679477.247     0.999915        18082     11702.86
  679477.247     0.999927        18082     13653.33
  679477.247     0.999939        18082     16384.00
  680001.535     0.999945        18083     18204.44
  680001.535     1.000000        18083          inf
#[Mean    =   200056.533, StdDeviation   =   184625.876]
#[Max     =   679477.248, Total count    =        18083]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18736 requests in 15.00m, 125.72MB read
  Socket errors: connect 0, read 0, write 12, timeout 171
Requests/sec:     20.82
Transfer/sec:    143.03KB